Hello! Is v1.2.1 is intended to fix this issue? I have just tested and see littlebit different issue

Plan:
```
Terraform will perform the following actions:
  # module.megaport-lbo.megaport_vxc.aws[0] will be updated in-place
  ~ resource "megaport_vxc" "aws" {
      ~ a_end                = {
          ~ current_product_uid   = "0a6f30e9-80ea-4dff-9d71-c874d3757067" -> (known after apply)
          ~ location              = "Digital Realty Interxion FRA6" -> (known after apply)
          ~ location_id           = 130 -> (known after apply)
          + ordered_vlan          = (known after apply)
          ~ product_name          = "LBO-EU-Frankfurt-ICSS-MVE" -> (known after apply)
          ~ vlan                  = 2640 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
      ~ b_end                = {
          ~ current_product_uid   = "4348e355-5e76-470b-988b-ac245c4[86](https://gitlab.com/1nce-tech/platform/base-services/infra/terraform/external-network/megaport/-/jobs/8292582675#L86)63b" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Digital Realty Interxion FRA6" -> (known after apply)
          ~ location_id           = 130 -> (known after apply)
          + ordered_vlan          = (known after apply)
          ~ product_name          = "EU (Frankfurt) (eu-central-1)" -> (known after apply)
          ~ requested_product_uid = "4348e355-5e76-470b-988b-ac245c48663b" -> "5ec445b7-6e15-4638-a2d7-8b9ab6ab0e62"
          ~ vlan                  = 2640 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Friday, 30-Aug-24 14:00:00 UTC" -> (known after apply)
      ~ contract_start_date  = "Wednesday, 31-Jul-24 09:19:24 UTC" -> (known after apply)
      ~ create_date          = "Wednesday, 31-Jul-24 09:17:45 UTC" -> (known after apply)
      ~ last_updated         = "Wednesday, 31-Jul-24 09:19:48 UTC" -> (known after apply)
      ~ live_date            = "Wednesday, 31-Jul-24 09:19:24 UTC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
        # (20 unchanged attributes hidden)
    }
  # module.megaport-lbo.megaport_vxc.ipxgrx[0] will be updated in-place
  ~ resource "megaport_vxc" "ipxgrx" {
      ~ a_end                = {
          ~ current_product_uid   = "0a6f30e9-80ea-4dff-9d71-c[87](https://gitlab.com/1nce-tech/platform/base-services/infra/terraform/external-network/megaport/-/jobs/8292582675#L87)4d3757067" -> (known after apply)
          ~ location              = "Digital Realty Interxion FRA6" -> (known after apply)
          ~ location_id           = 130 -> (known after apply)
          ~ product_name          = "LBO-EU-Frankfurt-ICSS-MVE" -> (known after apply)
          ~ vlan                  = 996 -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ b_end                = {
          ~ current_product_uid   = "fcda5cfe-c42f-4abb-8bab-2da65624e4ff" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Digital Realty Interxion FRA6" -> (known after apply)
          ~ location_id           = 130 -> (known after apply)
          ~ ordered_vlan          = 0 -> [100](https://gitlab.com/1nce-tech/platform/base-services/infra/terraform/external-network/megaport/-/jobs/8292582675#L100)
          ~ product_name          = "LBO-EU-Frankfurt-ICSS-Port" -> (known after apply)
          ~ vlan                  = 100 -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Friday, 19-Jul-24 14:00:00 UTC" -> (known after apply)
      ~ contract_start_date  = "Thursday, 04-Jul-24 16:05:00 UTC" -> (known after apply)
      ~ create_date          = "Thursday, 20-Jun-24 10:26:33 UTC" -> (known after apply)
      + csp_connections      = (known after apply)
      ~ last_updated         = "Thursday, 20-Jun-24 10:28:06 UTC" -> (known after apply)
      ~ live_date            = "Thursday, 22-Aug-24 14:22:36 UTC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
        # (19 unchanged attributes hidden)
    }
Plan: 0 to add, 2 to change, 0 to destroy.
```

Apply:
```
module.megaport-lbo.megaport_vxc.aws[0]: Modifying...
╷
│ Error: Error Updating VXC
│ 
│   with module.megaport-lbo.megaport_vxc.ipxgrx[0],
│   on .terraform/modules/megaport-lbo/main.tf line 67, in resource "megaport_vxc" "ipxgrx":
│   67: resource "megaport_vxc" "ipxgrx" {
│ 
│ Could not update VXC with ID 49a7be28-2148-4887-924b-9e089d007bb4: PUT
│ https://api.megaport.com/v3/product/vxc/49a7be28-2148-4887-924b-9e089d007bb4:
│ 400 (trace_id "b43de0b44f25615362f1e736a0d384b8") VRouter: VXC VLAN does
│ not match any vNIC, Validation of csp_request failed 
╵
╷
│ Error: Error Updating VXC
│ 
│   with module.megaport-lbo.megaport_vxc.aws[0],
│   on .terraform/modules/megaport-lbo/main.tf line 89, in resource "megaport_vxc" "aws":
│   89: resource "megaport_vxc" "aws" {
│ 
│ Could not update VXC with ID 94d49d6e-c166-423f-a5f0-59[72](https://gitlab.com/1nce-tech/platform/base-services/infra/terraform/external-network/megaport/-/jobs/8292582678#L72)b15cda6c: PUT
│ https://api.megaport.com/v3/product/vxc/94d49d6e-c166-423f-a5f0-5972b15cda6c:
│ 400 (trace_id "90fdd0ef5d5b620084bb8d97e5860309") AWSHC: cannot move to
│ this port 
╵
```